/**
  * 프로그램 설명문서 주석
  * 2021.01.03 수업
  * 
  * =====빌트 인 오브젝트=====
  * 
  * -- 총 11개의 오브젝트 --
  * 
  * - Number 오브젝트
  * --> 123과 같은 숫자, 상수, 지수
  * 
  * - String 오브젝트
  * --> "abc"와 같은 문자열, 분리, 연결
  * 
  * - Boolean 오브젝트
  * --> true, false
  * 
  * - Object 오브젝트
  * --> {key:value} 형태 ((프로퍼티를 처리하기 위한 오브젝트(for ~ in등의 형태를 지원)
  * 
  * - Array 오브젝트
  * --> [1,2,"A", "가나다"] 형태 ((값을 대괄호[]안에 작성
  * 
  * - Function 오브젝트
  * --> function abc(){} 형태 ((함수를 지원하기위한 오브젝트
  * 
  * - Math 오브젝트
  * --> abs(),round() 등의 수학 계산 ((절대값,반돌림등의 수학적 계산 지원 오브젝트
  * 
  * - Date 오브젝트
  * --> 연월일, 시분초 ((밀리초등 현재시간,과거시간 미래시간 값을 구하고 설정할 수 있는 오브젝트
  * 
  * - JSON 오브젝트
  * --> [{"name":"value"}] 형태 ((서버와 통신하는 데이터형태를 지원하는 오브젝트,""로 프로퍼티이름과 값을 감싸는 형태 -감싸지 않을수도 있음
  * --> 서버와 데이터 송수신에 사용
  * 
  * - RegExp 오브젝트
  * --> ^,$와 같은 정규 표현식 ((캐럿,달러같은 기호. 각각기호가 기능을 가지고있음
  * --> 본 강좌에서 다루지 않음 
  * 
  * - 글로벌(Global) 오브젝트
  * --> 소스 파일 전체에서 하나만 존재
  * --> 모든 코드에서 공유, 접근 가능
  * --> 전역 객체라고도 하며, 뉘앙스에 차이 있음
 */

